Revit 2024 API
ParameterTypeId.ProjectBuildingType Property
 "Building Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ProjectBuildingType { get; }
Visual Basic
Public Shared ReadOnly Property ProjectBuildingType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ProjectBuildingType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace